[{"id":"1763851993566","title":"Templates (Global)","description":"Templates will be premade examples based on policy. They will show only when the type is selected so only applicable templates are shown. ","priority":"medium","dueDate":"2026-01-01","completed":false,"createdAt":"2025-11-22T22:53:13.566Z","source":"Facebook","feedbackSummary":"Any plans to add functionality to generate Ch. 12 formatted products?","status":"Submitted","effortEstimate":"Small","completionDate":null,"rejectionReason":""},{"id":"1763852074030","title":"Templates (Unit)","description":"Allow the same concept as global templates but for unit. This will be rendered based on the unit selected for the header. ","priority":"medium","dueDate":null,"completed":false,"createdAt":"2025-11-22T22:54:34.030Z","source":"Facebook","feedbackSummary":"","status":"Submitted","effortEstimate":"Small","completionDate":null,"rejectionReason":""},{"id":"1763853190533","title":"MEMORANDUMS Type","description":"A memorandum provides a less formal way to correspond within an activity/command.  Subordinates within that activity or command may use a memorandum to correspond directly with each other on routine official business or as an informal means of communication. ","priority":"medium","dueDate":null,"completed":true,"createdAt":"2025-11-22T23:13:10.533Z","source":"Facebook","feedbackSummary":"Used to ensure all types are added.","submittedBy":"","status":"Draft"},{"id":"1763853233900","title":"BUSINESS LETTERS type","description":"Use the business letter to correspond with agencies, businesses, or individuals outside DoD, who are unfamiliar with the standard letter.  It also may be used for official correspondence between individuals within DoD, when the occasion calls for a personal approach. ","priority":"medium","dueDate":null,"completed":false,"createdAt":"2025-11-22T23:13:53.900Z","source":"Facebook","feedbackSummary":"To ensure we have all types","submittedBy":"","status":"Draft"},{"id":"1763853273812","title":"EXECUTIVE CORRESPONDENCE type","description":"This section provides specific guidance on the internal and external written communication particular to the Headquarters, Department of the Navy (HqDON).  When forwarding correspondence to the Office of the Secretary of Defense (OSD), the Military Departments, the Office of the Chairman of the Joint Chiefs of Staff and the Joint Staff, the Defense Agencies, the Department of Defense (DoD) Field Activities, and all other organizational entities within the DoD and HqDON, every effort should be made to strictly adhere to prescribed formats, as deviation could unnecessarily delay processing for administrative action or complete restaffing. ","priority":"medium","dueDate":null,"completed":false,"createdAt":"2025-11-22T23:14:33.812Z","source":"Facebook","feedbackSummary":"Any plans to add functionality to generate Ch. 12 formatted products?","submittedBy":"Justin Millsap","status":"Draft"},{"id":"1763853473349","title":"Same Page Endorsement ","description":"When a letter is transmitted via your activity, use an endorsement to forward comments, recommendations, or information.  While an endorsement is mostly used to transmit correspondence through the chain of command, you may also use it to redirect a letter.  Do not use an endorsement to reply to a routine letter.  Additionally, a “Via” addressee may alter the order of any remaining “Via” addressees or add others.  The length of the endorsement and the amount of space that is available on the basic letter or on the preceding endorsement determines if you should use a same-page or new page endorsement.  If it will completely fit on the signature page of the basic letter or the preceding endorsement, you may add it to that page.  If not, use a new-page endorsement. ","priority":"medium","dueDate":null,"completed":false,"createdAt":"2025-11-22T23:17:53.349Z","source":"Facebook","feedbackSummary":"Appointment letter format option would be beneficial. Aside from that I absolutely love it","submittedBy":"Jay Micheal","status":"Draft"}]